Revit 2027 API
ExternalServices.BuiltInExternalServices.MacroManagerUIService Property
 The UI service which permits registration of an external server for new Macro Manager UI.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId MacroManagerUIService { get; }
Public Shared ReadOnly Property MacroManagerUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ MacroManagerUIService {
	ExternalServiceId^ get ();
}
static member MacroManagerUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace